{"backend": "tensorflow", "keras_version": "2.1.4", "config": [{"class_name": "LSTM", "config": {"name": "lstm_3", "kernel_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "use_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "units": 128, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "trainable": true, "unit_forget_bias": true, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_constraint": null, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 40, 54], "activity_regularizer": null, "unroll": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "units": 54, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}], "class_name": "Sequential"}