{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "trainable": true, "unit_forget_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, 40, 58], "use_bias": true, "recurrent_dropout": 0.0, "name": "lstm_2", "return_state": false, "unroll": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_sequences": false, "units": 128, "kernel_regularizer": null, "stateful": false, "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 58, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_98", "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}]}